# Structured Query Language (SQL)

## Where To Learn SQL

**1. SQLZoo: The Wikipedia of SQL Learning** https://sqlzoo.net/wiki/SQL_Tutorial

**2. SQLBolt**
https://sqlbolt.com/

## Database Management Systems (DBMS)

[Comparing MySQL, PostgreSQL, and MongoDB](https://vercel.com/guides/mysql-vs-postgresql-vs-mongodb)

**1. MySQL**

**2. PostgreSQL**

**3. InfluxDB**

**4. MongoDB**

## Process for planning and designing a database before you create the SQL Database and Tables

**1. Identify and understand the main objects in your project**

Define the columns, table names, data types, relationship between tables, 

Example:
* Machine name: Pump Test Bench
* Oil Temperature: °C
* Hydraulic System Pressure: bar
* Hydraulic System Flow Rate: l/min
* Electric Motor Speed: RPM
* Ambient Temperature: °C
* Humidity: rH
* Ambient Noise: 
* Vibration:

**2. Ask questions**

Example:
* What is the relationship between A and B?
* If A changes, does B stays the same or not?
* What is the impact?

**2. Sketch the Entity Relationship Diagram**

(source: https://www.youtube.com/watch?v=5nGC4fyFPes)

* An Entity-Relationship Diagram describes the relationship of entities that need to be stored in a database

* ER Diagram is mainly a structural design for the database. It is a framework using specialized symbols to define the relationship between entities

* ER Diagram is created based on three main components: 

    * Entities: It is a thing, place, person or object that is independent of another/ a definable thing or concept within a system, such as a person/role (e.g. Student), object (e.g. Invoice), concept (e.g. Profile) or event (e.g. Transaction) 

    * Attributes: Describes the property of an entity such as Name, Address, Age, etc
        * Key Attribute uniquely identifies an entity from a set of entities and the text of the key attribute is <u>underlined</u>
        * Composite Attribute is composed of other attributes and connected with other attribute such as First_Name, Middle_Name, Last_Name

    * Relationships: Describes the relationship among Entities
        * One-to-One: A single element of an entity that is associated with a single element of another entity such as a student only has one identification card
        * One-to-Many: A single element of an entity that is associated with more than one element of another entity such as a customer can place many orders, but an order cannot be placed by many customers
        * Many-to-One: More than one element of an entity is related with a single element of another entity such as student enrolls for only one course, but a course can have many students
        * Many-to-Many: More than one element of an entity is associated with more than one element of another entity such as employee can be assigned to many projects and a project can be assigned to many employees

* Symbols used in ER Diagram
<img src="./images/Symbols_ER_Diagram.png">

* Components of ER Diagram
<img src="./images/Components_ER_Diagram.png">

* How to draw an ER Diagram
    1. Identify all the Entities. Embed all the entities in a rectangle and label them properly.
    2. Identify relationships between Entities and connect them using a diamond shape in the middle illustrating the relationship. Do not connect relationships to each other
    3. Connect attributes for entities and label them properly
    4. Eradicate any redundant entities or relationships
    5. Make sure your ER Diagram supports all the data provided to design the database
    6. Make effective use of colors to highlight key areas in your diagrams.

* Example of online platforms to design ER Diagram:
    * Lucid: https://www.lucidchart.com/pages/database-diagram/database-design
    * Sqldbm: https://sqldbm.com/

**3. Draft the SQL statements that will create your database**

`CREATE TABLE, DROP TABLE, INSERT INTO, SELECT, JOIN, WHERE, `

* To retrieve data from a SQL database, we need to write `SELECT` statements (referred to as *queries*).

    Given a table of data, we can query for a specific columns:

    `SELECT column, another_column, ... FROM mytable`

    We can query all columns of data from a table:

    `SELECT * FROM mytable`

* To filter certain results from being returned, we need to use `WHERE` clause in the query.

    `SELECT column, another_column, ... FROM mytable WHERE condition AND/OR another_condition AND/OR ...;`

    Below are some useful operators to use for numerical data (integer or floating point)

In [2]:
import pandas as pd

pd.set_option("display.max_colwidth", 1)

data = [
("=, !=, <, <=, >, >=",	"Standard numerical operators",	"col_name != 4"),
("BETWEEN … AND …",	"Number is within range of two values (inclusive)",	"col_name BETWEEN 1.5 AND 10.5"),
("NOT BETWEEN … AND …",	"Number is not within range of two values (inclusive)",	"col_name NOT BETWEEN 1 AND 10"),
("IN (…)",	"Number exists in a list",	"col_name IN (2, 4, 6)"),
("NOT IN (…)",	"Number does not exist in a list", "col_name NOT IN (1, 3, 5)")
]

df = pd.DataFrame(data, columns=["Operator", "Condition", "SQL Example"])

df

,Operator,Condition,SQL Example
0,"=, !=, <, <=, >, >=",Standard numerical operators,col_name != 4
1,BETWEEN … AND …,Number is within range of two values (inclusive),col_name BETWEEN 1.5 AND 10.5
2,NOT BETWEEN … AND …,Number is not within range of two values (inclusive),col_name NOT BETWEEN 1 AND 10
3,IN (…),Number exists in a list,"col_name IN (2, 4, 6)"
4,NOT IN (…),Number does not exist in a list,"col_name NOT IN (1, 3, 5)"

Examples:

1. Find the temperature with a row **Id** of 6 --> `SELECT * FROM temp_table WHERE Id = 6;`

2. Find the price in the **year**s between 2000 and 2010 --> `SELECT * FROM sale_table WHERE year BETWEEN 2000 AND 2010;`

3. Find the price not in the **year**s between 2000 and 2010 --> `SELECT * FROM sale_table WHERE year NOT BETWEEN 2000 AND 2010;`

4. Find the first 5 hydraulic oil pressure and their timestamp --> `SELECT * FROM pressure_table WHERE Id BETWEEN 1 AND 5;`

* When writing **WHERE** clauses with columns containing text data, SQL supports operators to do things like case-sensitive string comparison and wildcard pattern matching.

    A few common text-data specific operators:

In [3]:
data = [
("=",	"Case sensitive exact string comparison (notice the single equals)",	"col_name = 'abc'"),
("!= or <>",	"Case sensitive exact string inequality comparison",	"col_name != 'abcd'"),
("LIKE",	"Case insensitive exact string comparison",	"col_name LIKE 'ABC'"),
("NOT LIKE",	"Case insensitive exact string inequality comparison",	"col_name NOT LIKE 'ABCD'"),
("%",	"Used anywhere in a string to match a sequence of zero or more characters (only with LIKE or NOT LIKE)",	"col_name LIKE '%AT%' (matches 'AT', 'ATTIC', 'CAT' or even 'BATS')"),
("_",	"Used anywhere in a string to match a single character (only with LIKE or NOT LIKE)",	"col_name LIKE 'AN_' (matches 'AND', but not 'AN')"),
("IN (…)",	"String exists in a list",	"col_name IN ('A', 'B', 'C')"),
("NOT IN (…)",	"String does not exist in a list",	"col_name NOT IN ('D', 'E', 'F')")
]

df = pd.DataFrame(data, columns=["Operator", "Condition", "SQL Example"])

df

,Operator,Condition,SQL Example
0,=,Case sensitive exact string comparison (notice the single equals),col_name = 'abc'
1,!= or <>,Case sensitive exact string inequality comparison,col_name != 'abcd'
2,LIKE,Case insensitive exact string comparison,col_name LIKE 'ABC'
3,NOT LIKE,Case insensitive exact string inequality comparison,col_name NOT LIKE 'ABCD'
4,%,Used anywhere in a string to match a sequence of zero or more characters (only with LIKE or NOT LIKE),"col_name LIKE '%AT%' (matches 'AT', 'ATTIC', 'CAT' or even 'BATS')"
5,_,Used anywhere in a string to match a single character (only with LIKE or NOT LIKE),"col_name LIKE 'AN_' (matches 'AND', but not 'AN')"
6,IN (…),String exists in a list,"col_name IN ('A', 'B', 'C')"
7,NOT IN (…),String does not exist in a list,"col_name NOT IN ('D', 'E', 'F')"

Examples:

1. Find only Toy Store movie --> `SELECT * FROM movies WHERE Title = "Toy Story";`

2. Find all the Toy Story movies --> `SELECT * FROM movies WHERE Title LIKE "Toy Story%";`

3. Find all the projects by Farees --> `SELECT * FROM projects WHERE Name = "FAREES";`

* SQL provides a convenient way to discard rows that have a *duplicate* column by using **DISTINCT** keyword.

    Select query with unique results:

    `SELECT DISTINCT column, another_column, ... FROM mytable WHERE condition(s);`

### Ordering Results

* SQL provides a way to sort the results of a query by a given column in *ascending* or *descending* order using **ORDER BY** clause.

    Select query with ordered results:

    `SELECT column, another_column, ... FROM mytable WHERE condition(s) ORDER BY column ASC/DESC;`

    When an **ORDER BY** clause is specified, each row is sorted alpha-numerically based on the specified column's value.


### Limiting Results to a Subset

* **LIMIT** and **OFFSET** clauses are a useful optimization to indicate to the database the subset of the results you care about.

    * The **LIMIT** will reduce the number of rows to return

    * The optional **OFFSET** will specify where to begin counting the number rows from

    Select query with limited rows:

    `SELECT column, another_column, ... FROM mytable WHERE condition(s) ORDER BY column ASC/DESC LIMIT num_limit OFFSET num_offset;`

Examples: 

`SELECT DISTINCT Director FROM movies ORDER BY Director;`

`SELECT title, year FROM movies ORDER BY year DESC LIMIT 4;`

`SELECT Title, Year FROM movies ORDER BY Title ASC LIMIT 5;`

`SELECT Title, Year FROM movies ORDER BY title ASC LIMIT 5 OFFSET 5;`

### Simple **SELECT** Queries

Examples:

`SELECT * FROM north_american_cities WHERE country = "Canada";`

`SELECT * FROM north_american_cities WHERE country = "United States" ORDER BY Latitude DESC;`

`SELECT city, longitude FROM north_american_cities WHERE longitude < -87.629798 ORDER BY longitude ASC;`

`SELECT * FROM north_american_cities WHERE country = "Mexico" ORDER BY population DESC LIMIT 2;`

`SELECT * FROM north_american_cities WHERE country = "United States" ORDER BY population DESC LIMIT 2 OFFSET 2;`

### Database Normalization

* Minimizes duplicate data in any single table, and allows for data in the database to grow independently of each other.

### Multi-table Queries with JOINs

* Table that share information about a single entity need to have a *primary key* that identifies that entity *uniquely* accross the database.

* One common primary key type is an auto-incrementing integer, but it can also be a string, hashed value, so long as it is unique.

* Using the **JOIN** clause in a query, we can combine row data accross two separate tables using this unique key.

* Select query with **INNER JOIN** on multiple tables

`SELECT column, another_table_column,...`

`FROM mytable`

`INNER JOIN another_table`

        `ON mytable.id = another_table.id`

`WHERE condition(s)`

`ORDER BY column, ... ASC/DESC`

`LIMIT num_limit OFFSET num_offset;`

* The **INNER JOIN** is a process that matches rows from the first table and the second table which have the same key (as defined by the **ON** constraint) 
    
    to create a result row with the combined columns from both tables. Other clauses will be applied after the tables are joined.

Examples:

`SELECT id, title, domestic_sales, international_sales FROM movies
INNER JOIN boxoffice ON movies.id = boxoffice.movie_id;`

`SELECT id, title, domestic_sales, international_sales FROM movies
INNER JOIN boxoffice ON movies.id = boxoffice.movie_id
WHERE international_sales > domestic_sales;`

`SELECT title, rating FROM movies
INNER JOIN boxoffice ON movies.id = boxoffice.movie_id
WHERE rating ORDER BY rating DESC;`

* We would use a **LEFT JOIN, RIGHT JOIN** or **FULL JOIN**, if two tables have asymmetric data:

        `SELECT column, another_table_column,...`

        `FROM mytable`

        `INNER/LEFT/RIGHT/FULL JOIN another_table`

                `ON mytable.id = another_table.matching_id`

        `WHERE condition(s)`

        `ORDER BY column, ... ASC/DESC`

        `LIMIT num_limit OFFSET num_offset;`

Examples: 

`SELECT DISTINCT building, building_name FROM employees
LEFT JOIN buildings ON employees.building = buildings.building_name;`

`SELECT * FROM buildings;`

`SELECT DISTINCT building_name, role 
FROM buildings 
  LEFT JOIN employees
    ON building_name = building;`

* You can test a column for **NULL** values in a **WHERE** clause by using either the **IS NULL** or **IS NOT NULL** constraint.

    `SELECT column, another_column FROM mytable WHERE column IS/IS NOT NULL AND/OR another_condition AND/OR ...;`

    Examples:

    `SELECT name, role FROM employees WHERE building IS NULL;`

    `SELECT building_name FROM buildings LEFT JOIN employees ON building_name = building WHERE building IS NULL;`

### Queries with expressions

* We can use *expressions* to write more complex logic on column values in a query.

* These expressions can use mathematical and string functions along with basic arithmetic to transform values when the query is executed.

* Example: `SELECT particle_speed / 2.0 AS half_particle_speed FROM physics_data WHERE ABS(particle_position) * 10.0 > 500;`

* When expressions are used in the **SELECT** part of the query, that they are also given a descriptive *alias* using the **AS** keyword.

* Example: `SELECT col_expression AS expr_description, ... FROM mytable;`

* Regular columns and even tables can also have aliases to make them easier to reference in the output and as a part of simplifying more complex queries:

*  `SELECT column AS better_column_name, ... FROM a_long_widgets_table_name AS mywidgets INNER JOIN widget_sales ON mywidgets.id = widget_sales.widget_id;`

Examples:

* List all movies and their combined sales in **millions** of dollars: `SELECT title, domestic_sales, international_sales, (domestic_sales + international_sales)/1000000 AS combined_sales_in_mil 
FROM boxoffice INNER JOIN movies ON id = movie_id;`

* List all movies and their ratings in **percent**: `SELECT id, title, rating, rating * 10 AS rating_in_percent FROM movies 
INNER JOIN boxoffice ON id = movie_id ORDER BY rating DESC;`

* List all movies that were released on even number years: `SELECT title, year FROM movies WHERE NOT year % 2;`

### Queries with aggregates

* SQL also supports the use of aggregate expressions (or functions) to summarize information about a group of rows of data

* Select query with aggregate functions over all rows:

    `SELECT AGG_FUNC(column_or_expression) AS aggregate_description, ... FROM mytable WHERE constraint_expression;`

* Each aggregate function is going to run on the whole set of result rows and return a single value

* Here are some common aggregate functions:

In [4]:
data = [
    ("COUNT(*), COUNT(column)", "A common function used to counts the number of rows in the group if no column name is specified. Otherwise, count the number of rows in the group with non-NULL values in the specified column."),
    ("MIN(column)", "Finds the smallest numerical value in the specified column for all rows in the group."),
    ("MAX(column)", "Finds the largest numerical value in the specified column for all rows in the group."),
    ("AVG(column)", "Finds the average numerical value in the specified column for all rows in the group."),
    ("SUM(column)", "Finds the sum of all numerical values in the specified column for the rows in the group.")
]

df = pd.DataFrame(data, columns=["Function", "Description"])

df

,Function,Description
0,"COUNT(*), COUNT(column)","A common function used to counts the number of rows in the group if no column name is specified. Otherwise, count the number of rows in the group with non-NULL values in the specified column."
1,MIN(column),Finds the smallest numerical value in the specified column for all rows in the group.
2,MAX(column),Finds the largest numerical value in the specified column for all rows in the group.
3,AVG(column),Finds the average numerical value in the specified column for all rows in the group.
4,SUM(column),Finds the sum of all numerical values in the specified column for the rows in the group.

* You can apply the aggregate functions to individual groups of data within that group. 

* This would then create as many results as there are unique groups defined by the **GROUP BY** clause.

    `SELECT AGG_FUNC(column_or_expression) AS aggregate_description, ... FROM mytable WHERE constraint_expression GROUP BY column;`

* The **GROUP BY** clause works by grouping rows that have the same value in the column specified

* Examples:

    * Find the longest time that an employee has been working: `SELECT MAX(years_employed) AS longest_employee FROM employees;`

    * For each role, find the average number of years employed by employees in that role: `SELECT role, AVG(years_employed) FROM employees WHERE years_employed GROUP BY role;`

    * Find the total number of employee years working in each building: `SELECT building, SUM(years_employed) FROM employees WHERE years_employed GROUP BY building;`

* By adding an additional **HAVING** clause which is used specifically with the **GROUP BY** clause to allow us to filter grouped rows from the result set

    `SELECT group_by_column, AGG_FUNC(column_expression) AS aggregate_result_alias, ...` 
    
    `FROM mytable` 
    
    `WHERE condition`

    `GROUP BY column`

    `HAVING group_condition;`

* Examples:

    * Find the number of Artists in the studio (without a **HAVING** clause): `SELECT SUM(role = "Artist") FROM employees;`

    * Find the number of Employees of each role in the studio: `SELECT role, COUNT(*) FROM employees GROUP BY role;`

    * Find the total number of years employed by all Engineers: `SELECT role, SUM(years_employed) FROM employees WHERE role = "Engineer";` **OR** `SELECT role, SUM(years_employed) FROM employees GROUP BY role HAVING role = "Engineer";`

### Order execution of a Query

* Complete **SELECT** Query:

    * `SELECT DISTINCT column, AGG_FUNC(column_or_expression), ...`

        `FROM mytable`

            `JOIN another_table`

            `ON mytable.column = another_table.column`

            `WHERE constraint_expression`

            `GROUP BY column`

            `HAVING constraint_expression`

            `ORDER BY column ASC/DESC`

            `LIMIT count OFFSET count;`

* Query order of execution:

    1. **FROM** and **JOIN**s are first executed to determine the total working set of data that is being queried.

    2. Once we have the total working set of data, the first-pass **WHERE** constraints are applied to the individual rows, and rows that do not satisfy the constraint are discarded.

    3. The remaining rows after the **WHERE** constraints are applied are then grouped based on common valuesin the column specified in the **GROUP BY** clause. As a result of the grouping, there will only be as many rows as there are unique values in that column.

    4. If the query has a **GROUP BY** clause, then the constraints in the **HAVING** clause are then applied to the grouped rows, discard the grouped rows that don't satisfy the constraint.

    5. Any expressions in the **SELECT** part of the query are finally computed.

    6. Of the remaining rows, rows with duplicate values in the column marked as **DISTINCT** will be discarded.

    7. If an order is specified by the **ORDER BY** clause, the rows are then sorted by the specified data in either ascending **ASC** or descending **DESC** order.

    8. Finally, the rows that fall outside the range specified by the **LIMIT** and **OFFSET** are discarded, leaving the final set of rows to be returned from the query.

    
    Examples:

    * Find the number of movies each director has directed: `SELECT director, COUNT(*) FROM movies GROUP BY director;` **OR** `SELECT director COUNT(id) as Num_movies_directed FROM movies GROUP BY director;`

    * Find the total domestic and international sales that can be attributed to each director: 
    
        `SELECT director, SUM(domestic_sales + international_sales) AS total_sales FROM movies JOIN boxoffice ON movies.id = boxoffice.movie_id GROUP BY director;`

        OR

        `SELECT director, SUM(domestic_sales + international_sales) AS total_sales FROM movies INNER JOIN boxoffice ON movies.id = boxoffice.movie_id GROUP BY director;`
        
        OR
        
        `SELECT director, SUM(domestic_sales + international_sales) as Cumulative_sales_from_all_movies FROM movies INNER JOIN boxoffice ON movies.id = boxoffice.movie_id GROUP BY director;`

### Inserting rows

* In SQL, the *database schema* is what describes the structure of each table, and the datatypes that each column of the table can contain.

* Inserting new data:

* Insert statement with values for all columns

`INSERT INTO mytable
VALUES (value_or_expr, another_value_or_expr, …),
       (value_or_expr_2, another_value_or_expr_2, …),
       …;`
      
      
* Insert statement with specific columns

`INSERT INTO mytable (column, another_column, …)
VALUES (value_or_expr, another_value_or_expr, …),
      (value_or_expr_2, another_value_or_expr_2, …),
      …;`

### Updating rows

* In addition to adding new data, a common task is to update existing data, which can be done using an **UPDATE** statement.

* Update statement with values:

    `UPDATE mytable SET column = value_or_expr, other_column = another_value_or_expr, ... WHERE condition;`

* The statement works by taking multiple column/value pairs, and applying those changes to each and every row that satisfies the constraint in the **WHERE** clause.

* To avoid making mistakes updating data, it is helpful to write the constraint first and test it in a **SELECT** query to make sure you are updating the right rows, and only then writing the column/value pairs to update.

* Examples:

    1. The director for A Bug's Life is incorrect, it was actually directed by **John Lasseter**: `UPDATE movies SET director = "John Lasseter" WHERE title = "A Bug's Life;`

    2. The year that Toy Story 2 was released is incorrect, it was actually released in **1999**: `UPDATE movies SET year = 1999 WHERE title = "Toy Story 2";`

    3. Both the title and director for Toy Story 8 is incorrect! The title should be "Toy Story 3" and it was directed by **Lee Unkrich**: `UPDATE movies SET title = "Toy Story 3", director = "Lee Unkrich" WHERE title = "Toy Story 8";`

### Deleting rows

* You can use a **DELETE** statement when you need to delete data from a table in the database.

* The **DELETE** statement describes the table to act on, and the rows of the table to delete through the **WHERE** clause.

* `DELETE FROM mytable WHERE condition;`

* An easy and quick way to clear out a table completely is to leave out the **WHERE** constraint which then removes all the rows.

* To avoid making mistakes deleting data, it is helpful to run the constraint in a **SELECT** query first to ensure you are removing the right rows.

* Examples:

    1. This database is getting too big, lets remove all movies that were released **before** 2005: 
    
        First, run the constraint in a **SELECT** query: `SELECT * FROM movies WHERE year < 2005;`
    
        Then, proceed to delete rows `DELETE FROM movies WHERE year < 2005;`

    2. Andrew Stanton has also left the studio, so please remove all movies directed by him: 
    
        First, run the constraint in a **SELECT** query: `SELECT * FROM movies WHERE director = "Andrew Stanton";`

        Then, proceed to delete data: `DELETE FROM movies WHERE director = "Andrew Stanton";`

### Creating Tables

* You can create a new database table using the **CREATE TABLE** statement when you have new entities and relationships to store in your database.

    `CREATE TABLE IF NOT EXISTS mytable (column DataType TableConstraint DEFAULT default_value, another_column DataType TableConstraint DEFAULT default_value, ...);`

* The *table schema* defines a series of columns. Each column has a name, the type of data allowed in that column, an *optional* table constraint on values being inserted, and an optional default value.

* You can use the **IF NOT EXISTS** clause, if there already exists a table with the same name so to avoid the SQL implementation error and skip creating a table if one exists.

* Table data types:

In [5]:
data = [
    ("INTEGER, BOOLEAN", "The integer datatypes can store whole integer values like the count of a number or an age. In some implementations, the boolean value is just represented as an integer value of just 0 or 1."),
    ("FLOAT, DOUBLE, REAL", "The floating point datatypes can store more precise numerical data like measurements or fractional values. Different types can be used depending on the floating point precision required for that value."),
    ("CHARACTER(num_chars), VARCHAR(num_chars), TEXT", "The text based datatypes can store strings and text in all sorts of locales. The distinction between the various types generally amount to underlaying efficiency of the database when working with these columns. Both the CHARACTER and VARCHAR (variable character) types are specified with the max number of characters that they can store (longer values may be truncated), so can be more efficient to store and query with big tables.."),
    ("DATE, DATETIME", "SQL can also store date and time stamps to keep track of time series and event data. They can be tricky to work with especially when manipulating data across timezones."),
    ("BLOB", "Finally, SQL can store binary data in blobs right in the database. These values are often opaque to the database, so you usually have to store them with the right metadata to requery them.")
]

df = pd.DataFrame(data, columns=["Data type", "Description"])

df

,Data type,Description
0,"INTEGER, BOOLEAN","The integer datatypes can store whole integer values like the count of a number or an age. In some implementations, the boolean value is just represented as an integer value of just 0 or 1."
1,"FLOAT, DOUBLE, REAL",The floating point datatypes can store more precise numerical data like measurements or fractional values. Different types can be used depending on the floating point precision required for that value.
2,"CHARACTER(num_chars), VARCHAR(num_chars), TEXT","The text based datatypes can store strings and text in all sorts of locales. The distinction between the various types generally amount to underlaying efficiency of the database when working with these columns. Both the CHARACTER and VARCHAR (variable character) types are specified with the max number of characters that they can store (longer values may be truncated), so can be more efficient to store and query with big tables.."
3,"DATE, DATETIME",SQL can also store date and time stamps to keep track of time series and event data. They can be tricky to work with especially when manipulating data across timezones.
4,BLOB,"Finally, SQL can store binary data in blobs right in the database. These values are often opaque to the database, so you usually have to store them with the right metadata to requery them."

* Table constraints:

In [7]:
data = [
    ("PRIMARY KEY", "This means that the values in this column are unique, and each value can be used to identify a single row in this table."),
    ("AUTOINCREMENT", "For integer values, this means that the value is automatically filled in and incremented with each row insertion. Not supported in all databases."),
    ("UNIQUE", "This means that the values in this column have to be unique, so you can't insert another row with the same value in this column as another row in the table. Differs from the `PRIMARY KEY` in that it doesn't have to be a key for a row in the table."),
    ("NOT NULL", "This means that the inserted value can not be `NULL`."),
    ("CHECK (expression)", "This allows you to run a more complex expression to test whether the values inserted are valid. For example, you can check that values are positive, or greater than a specific size, or start with a certain prefix, etc."),
    ("FOREIGN KEY", "This is a consistency check which ensures that each value in this column corresponds to another value in a column in another table. For example, if there are two tables, one listing all Employees by ID, and another listing their payroll information, the `FOREIGN KEY` can ensure that every row in the payroll table corresponds to a valid employee in the master Employee list.")
]

df = pd.DataFrame(data, columns=["Constraint", "Description"])

df

,Constraint,Description
0,PRIMARY KEY,"This means that the values in this column are unique, and each value can be used to identify a single row in this table."
1,AUTOINCREMENT,"For integer values, this means that the value is automatically filled in and incremented with each row insertion. Not supported in all databases."
2,UNIQUE,"This means that the values in this column have to be unique, so you can't insert another row with the same value in this column as another row in the table. Differs from the `PRIMARY KEY` in that it doesn't have to be a key for a row in the table."
3,NOT NULL,This means that the inserted value can not be `NULL`.
4,CHECK (expression),"This allows you to run a more complex expression to test whether the values inserted are valid. For example, you can check that values are positive, or greater than a specific size, or start with a certain prefix, etc."
5,FOREIGN KEY,"This is a consistency check which ensures that each value in this column corresponds to another value in a column in another table. For example, if there are two tables, one listing all Employees by ID, and another listing their payroll information, the `FOREIGN KEY` can ensure that every row in the payroll table corresponds to a valid employee in the master Employee list."

* Example Schema:

    `CREATE TABLE movies (
    id INTEGER PRIMARY KEY,
    title TEXT,
    director TEXT,
    year INTEGER, 
    length_minutes INTEGER
);`

* Example:

1. Create a new table named Database with the following columns:
– Name A string (text) describing the name of the database
– Version A number (floating point) of the latest version of this database
– Download_count An integer count of the number of times this database was downloaded

This table has no constraints.

Solution:

`CREATE TABLE database (
    name TEXT,
    version FLOAT,
    download_count INT
);`

## Altering tables

* SQL provides a way for you to update your corresponding tables and database schemas by using the **ALTER TABLE** statement to add, remove, or modify columns and table constraints.

### Adding Columns

* Specify the data type of the column along with any potential table constraints and default values to be applied to both existing and new rows.

* In MySQL, you can even specify where to insert the new column using the **FIRST** or **AFTER** clauses (not a standard feature in SQL)

* Example: `ALTER TABLE mytable ADD column DataType OptionalTableConstraint DEFAULT default_value;`

### Removing Columns

* It is as easy as specifying the column to drop, however some databases don't support this feature.

* In SQLite don't support this feature. Instead, create a new table and migrate the data over

* Example: `ALTER TABLE mytable DROP column_to_be_deleted;`

### Renaming the Table

* Use **RENAME TO** clause to rename the table itself

* Example: `ALTER TABLE mytable RENAME TO new_table_name;`

### Examples

1. Add a column named **Aspect_ratio** with a **FLOAT** data type to store the aspect-ratio each movie was released in : `ALTER TABLE movies ADD aspect_ratio FLOAT;`

2. Add another column named **Language** with a **TEXT** data type to store the language that the movie was released in. Ensure that the default for this language is **English**. : `ALTER TABLE movies ADD language TEXT DEFAULT "English";`

## Dropping Tables

* Only when you want to remove an entire table including all of its data and metadata, you can use the **DROP TABLE** statement, which differs from the **DELETE** statement in that it also removes the table schema from the database entirely.

* Example: `DROP TABLE IF EXISTS mytable;`

* Use the **IF EXISTS** clause to suppress the *table does not exist* error

* If you have another table that is dependant on columns in table you are removing (for example with a **FOREIGN KEY** dependency), you will have to either:

    * Update all dependent tables first to remove the dependent rows
    * Remove the tables entirely

### Examples

1. Remove the **Movies** table: `DROP TABLE IF EXISTS movies;`

2. Drop the **BoxOffice** table: `DROP TABLE IF EXISTS boxoffice;`

## Example in Python

In [6]:
# # Example 1 : Create an SQLite database to store our book data
# import sqlite3

# # create a SQLite database called "books-collection"
# db = sqlite3.connect("books-collection.db")

# # create a "cursor" to control our database. The cursor will be used to modify our SQLite database.
# cursor = db.cursor()

# # create a table called "books"
# # cursor.execute("CREATE TABLE books (id INTEGER PRIMARY KEY, title varchar(250) NOT NULL UNIQUE, author varchar(250) NOT NULL, rating FLOAT NOT NULL)")

# # insert data into the table 
# # NOTE: the create a table code above must be commented out before we insert data into the table
# cursor.execute("INSERT INTO books VALUES(2, 'Elon Musk', 'Ashlee Vance', '9.5')")
# db.commit()